# TrussSegmentedReference Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..TrussSegmentedReference Property
BuiltInFailures..::..SketchFailures Class See Also
---
Truss reference must form a continuous chain of one or more sketch lines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TrussSegmentedReference { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TrussSegmentedReference As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TrussSegmentedReference {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace